## pandas(2)

### 조건 필터링

In [1]:
import pandas as pd
import numpy as np

In [16]:
data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [90, 70, 95, 95],
    '반': [2, 1, 1, 2]
}
df = pd.DataFrame(data)
df

    이름  점수  반
0  홍길동  90  2
1  김철수  70  1
2  이영희  95  1
3  박민수  95  2

In [3]:
mask = df["점수"] >= 80
filtered = df[mask]
filtered

    이름  점수  반
0  홍길동  90  2
2  이영희  85  1
3  박민수  95  2

In [ ]:
# 여러조건 결합
# and : &
# or : |
# not : ~

# & 예시
df[(df["반"] == 1) & (df["점수"] >= 80)]

    이름  점수  반
2  이영희  85  1

In [12]:
# | 예시
df[(df["반"] == 2) | (df["점수"] >= 90)]

    이름  점수  반
0  홍길동  90  2
1  김철수  95  1
3  박민수  95  2

In [14]:
# isin()
# 여러 값 중에 하나에 해당하는지 여부를 판단할 때 사용

# mask = (df["이름"] == "홍길동") | (df["이름"] == "박민수") | (df["이름"] == "이영희")
mask = df["이름"].isin(["홍길동", "박민수"])
df[mask]

    이름  점수  반
0  홍길동  90  2
3  박민수  95  2

In [18]:
# not 사용 예시
mask = ~df["이름"].isin(["홍길동", "박민수"])
df[mask]

    이름  점수  반
1  김철수  70  1
2  이영희  95  1

In [ ]:
# reset_index
# 조건 필터링, 정렬 등을 통해 인덱스가 변경됐을시
# reset_index를 사용해서 인덱스를 초기화
mask = (df["반"] == 2) | (df["점수"] >= 90)
df2 = df[mask]
print(df2)

# 인덱스 리셋
# df2 = df2.reset_index()
# print(df2)

# 기존 인덱스 삭제
df2 = df2.reset_index(drop=True)
print(df2)

    이름  점수  반
0  홍길동  90  2
2  이영희  95  1
3  박민수  95  2
    이름  점수  반
0  홍길동  90  2
1  이영희  95  1
2  박민수  95  2

In [ ]:
df = pd.DataFrame({
    '이름': ['민준', '서연', '지후', '서준', '지민'],
    '점수': [78, 92, 85, 60, 88],
    '반': [1, 2, 1, 2, 1]
})

   이름  점수  반
0  민준  78  1
1  서연  92  2
2  지후  85  1
3  서준  60  2
4  지민  88  1

In [ ]:
# 실습1 문제1. 점수(score)가 80점 이상인 학생만 추출하세요.
df[df["점수"] >= 80]

   이름  점수  반
1  서연  92  2
2  지후  85  1
4  지민  88  1

In [ ]:
# 실습1 문제2. 1반(반==1) 학생들 중, 점수가 85점 이상인 학생만 추출하세요.
df[(df["반"] == 1) & (df["점수"] >= 85)]

   이름  점수  반
2  지후  85  1
4  지민  88  1

In [46]:
# 실습1 문제3. 이름이 '서연' 또는 '지민'인 학생만 추출하세요.
# df[(df['이름'] == '서연') | (df['이름'] == '지민')]
df_3 = df[df["이름"].isin(["서연", "지민"])]
df_3

   이름  점수  반
1  서연  92  2
4  지민  88  1

In [47]:
# 실습1 문제4. 문제 3에서 추출한 결과에서 인덱스를 0부터 재정렬하여 출력하세요.
df_3.reset_index(drop=True)

   이름  점수  반
0  서연  92  2
1  지민  88  1

In [48]:
# 실습1 문제5. 점수가 80점 미만이거나 2반인 학생만 추출하세요.
df_5 = df[(df["점수"] < 80) | (df["반"] == 2)]
df_5

   이름  점수  반
0  민준  78  1
1  서연  92  2
3  서준  60  2

In [49]:
# 실습1 문제6. 문제 5의 결과에서 '점수' 컬럼이 70점 이상인 학생만 다시 추출하고, 인덱스를 재정렬하여 출력하세요.
df_6 = df_5[df_5["점수"] >= 70].reset_index(drop=True)
df_6

   이름  점수  반
0  민준  78  1
1  서연  92  2